/*
 Navicat Premium Dump SQL

 Source Server         : localhost_3306
 Source Server Type    : MySQL
 Source Server Version : 90100 (9.1.0)
 Source Host           : localhost:3306
 Source Schema         : student

 Target Server Type    : MySQL
 Target Server Version : 90100 (9.1.0)
 File Encoding         : 65001

 Date: 14/05/2025 09:16:25
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for administer
-- ----------------------------
DROP TABLE IF EXISTS `administer`;
CREATE TABLE `administer`  (
  `username` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `password` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  PRIMARY KEY (`username`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of administer
-- ----------------------------
INSERT INTO `administer` VALUES ('root', '23030327');
INSERT INTO `administer` VALUES ('xzq', '758205Blns');

-- ----------------------------
-- Table structure for inform
-- ----------------------------
DROP TABLE IF EXISTS `inform`;
CREATE TABLE `inform`  (
  `student_id` char(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `birth_date` date NOT NULL,
  `gender` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `college` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `major` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `class` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `home_address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `home_phone` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `personal_phone` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  PRIMARY KEY (`student_id`) USING BTREE,
  CONSTRAINT `inform_chk_1` CHECK (`gender` in (_utf8mb4'男',_utf8mb4'女'))
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of inform
-- ----------------------------
INSERT INTO `inform` VALUES ('2023100001', '张三', '2002-05-13', '男', '计算机学院', '软件工程', '软件工程2023班', '北京市朝阳区某小区', '010-12345678', '13800138000');
INSERT INTO `inform` VALUES ('2023100002', '李四', '2003-03-22', '女', '电子信息学院', '通信工程', '通信工程2023班', '上海市浦东新区某小区', '021-87654321', '13900139000');
INSERT INTO `inform` VALUES ('2023100003', '王五', '2001-07-19', '男', '机械工程学院', '机械设计', '机械设计2023班', '广州市天河区某小区', '020-12344321', '13700137000');
INSERT INTO `inform` VALUES ('2023100004', '赵六', '2004-11-02', '女', '经济管理学院', '工商管理', '工商管理2023班', '成都市锦江区某小区', '028-98765432', '13600136000');
INSERT INTO `inform` VALUES ('2023100005', '孙七', '2002-08-26', '男', '建筑学院', '土木工程', '土木工程2023班', '南京市秦淮区某小区', '025-54321678', '13500135000');
INSERT INTO `inform` VALUES ('2023100006', '周八', '2002-09-03', '女', '艺术学院', '视觉传达设计', '视觉传达2023班', '杭州市西湖区某小区', '0571-21345678', '13800238000');
INSERT INTO `inform` VALUES ('2023100007', '吴九', '2001-06-10', '男', '外国语学院', '英语', '英语2023班', '武汉市洪山区某小区', '027-76543210', '13700337000');
INSERT INTO `inform` VALUES ('2023100008', '郑十', '2003-12-05', '女', '法学院', '法学', '法学2023班', '重庆市渝北区某小区', '023-12341234', '13900439000');
INSERT INTO `inform` VALUES ('2023100009', '钱十一', '2002-07-16', '男', '经济管理学院', '国际经济与贸易', '国贸2023班', '西安市雁塔区某小区', '029-87654321', '13700537000');
INSERT INTO `inform` VALUES ('2023100010', '孙十二', '2003-11-22', '女', '教育学院', '学前教育', '学前教育2023班', '长沙市芙蓉区某小区', '0731-12345678', '13800638000');
INSERT INTO `inform` VALUES ('2023100011', '李十三', '2004-03-15', '女', '历史学院', '历史学', '历史学2023班', '济南市历城区某小区', '0531-76543210', '13500735000');
INSERT INTO `inform` VALUES ('2023100012', '陈十四', '2001-01-30', '男', '物理学院', '应用物理', '应用物理2023班', '郑州市金水区某小区', '0371-98765432', '13600836000');
INSERT INTO `inform` VALUES ('2023100013', '林十五', '2003-10-11', '男', '数学学院', '统计学', '统计学2023班', '福州市鼓楼区某小区', '0591-21345678', '13800938000');
INSERT INTO `inform` VALUES ('2023100014', '刘十六', '2002-04-04', '女', '化学学院', '化学工程', '化工2023班', '哈尔滨市道里区某小区', '0451-12344321', '13701037000');
INSERT INTO `inform` VALUES ('2023100015', '朱十七', '2001-08-18', '男', '环境学院', '环境科学', '环境科学2023班', '南京市建邺区某小区', '025-87654321', '13901139000');
INSERT INTO `inform` VALUES ('2023100016', '黄十八', '2004-02-21', '女', '生物学院', '生物工程', '生物工程2023班', '天津市和平区某小区', '022-12341234', '13801238000');
INSERT INTO `inform` VALUES ('2023100017', '胡十九', '2002-06-09', '男', '体育学院', '体育教育', '体育教育2023班', '深圳市福田区某小区', '0755-76543210', '13701337000');
INSERT INTO `inform` VALUES ('2023100018', '高二十', '2003-09-06', '女', '新闻学院', '新闻学', '新闻学2023班', '青岛市市南区某小区', '0532-21345678', '13501435000');
INSERT INTO `inform` VALUES ('2023100019', '赵二一', '2004-01-01', '男', '医学院', '临床医学', '临床医学2023班', '昆明市五华区某小区', '0871-98765432', '13601536000');
INSERT INTO `inform` VALUES ('2023100020', '钟二二', '2003-05-07', '女', '音乐学院', '音乐表演', '音乐表演2023班', '南昌市东湖区某小区', '0791-12345678', '13801638000');
INSERT INTO `inform` VALUES ('2023100021', '何二三', '2002-10-16', '男', '计算机学院', '信息安全', '信息安全2023班', '北京市海淀区某小区', '010-76543210', '13701737000');
INSERT INTO `inform` VALUES ('2023100022', '吕二四', '2001-03-14', '女', '电子信息学院', '电子科学与技术', '电子科学2023班', '上海市徐汇区某小区', '021-87654321', '13901839000');
INSERT INTO `inform` VALUES ('2023100023', '施二五', '2004-07-23', '男', '机械工程学院', '机械电子工程', '机电工程2023班', '广州市越秀区某小区', '020-12344321', '13701937000');
INSERT INTO `inform` VALUES ('2023100024', '孔二六', '2002-12-01', '女', '经济管理学院', '市场营销', '市场营销2023班', '成都市武侯区某小区', '028-98765432', '13602036000');
INSERT INTO `inform` VALUES ('2023100025', '曹二七', '2003-01-20', '男', '建筑学院', '建筑学', '建筑学2023班', '南京市鼓楼区某小区', '025-54321678', '13502135000');
INSERT INTO `inform` VALUES ('2023100026', '严二八', '2001-11-12', '女', '艺术学院', '美术学', '美术学2023班', '杭州市滨江区某小区', '0571-21345678', '13802238000');
INSERT INTO `inform` VALUES ('2023100027', '华二九', '2002-02-28', '男', '外国语学院', '日语', '日语2023班', '武汉市武昌区某小区', '027-76543210', '13702337000');
INSERT INTO `inform` VALUES ('2023100028', '江三十', '2003-08-08', '女', '法学院', '国际法学', '国际法学2023班', '重庆市江北区某小区', '023-12341234', '13902439000');
INSERT INTO `inform` VALUES ('2023100029', '邓三一', '2004-06-25', '男', '经济管理学院', '会计学', '会计学2023班', '西安市新城区某小区', '029-87654321', '13702537000');
INSERT INTO `inform` VALUES ('2023100030', '何三二', '2002-05-10', '女', '教育学院', '教育技术学', '教育技术2023班', '长沙市天心区某小区', '0731-12345678', '13802638000');
INSERT INTO `inform` VALUES ('2023100031', '鲍三三', '2001-04-04', '男', '历史学院', '考古学', '考古学2023班', '济南市市中区某小区', '0531-76543210', '13502735000');
INSERT INTO `inform` VALUES ('2023100032', '章三四', '2003-07-29', '女', '物理学院', '光电信息科学', '光电科学2023班', '郑州市中原区某小区', '0371-98765432', '13602836000');
INSERT INTO `inform` VALUES ('2023100033', '云三五', '2002-03-15', '男', '数学学院', '数学与应用数学', '数学2023班', '福州市晋安区某小区', '0591-21345678', '13802938000');
INSERT INTO `inform` VALUES ('2023100034', '苏三六', '2001-09-17', '女', '化学学院', '化学', '化学2023班', '哈尔滨市香坊区某小区', '0451-12344321', '13703037000');
INSERT INTO `inform` VALUES ('2023100035', '潘三七', '2003-12-10', '男', '环境学院', '生态学', '生态学2023班', '南京市溧水区某小区', '025-87654321', '13903139000');
INSERT INTO `inform` VALUES ('2023100036', '葛三八', '2004-08-03', '女', '生物学院', '生物科学', '生物科学2023班', '天津市河东区某小区', '022-12341234', '13803238000');
INSERT INTO `inform` VALUES ('2023100037', '奚三九', '2002-11-05', '男', '体育学院', '运动训练', '运动训练2023班', '深圳市罗湖区某小区', '0755-76543210', '13703337000');
INSERT INTO `inform` VALUES ('2023100038', '范四十', '2003-10-14', '女', '新闻学院', '传播学', '传播学2023班', '青岛市市北区某小区', '0532-21345678', '13503435000');
INSERT INTO `inform` VALUES ('2023100039', '彭四一', '2001-06-08', '男', '医学院', '药学', '药学2023班', '昆明市盘龙区某小区', '0871-98765432', '13603536000');
INSERT INTO `inform` VALUES ('2023100040', '郎四二', '2002-09-11', '女', '音乐学院', '作曲与作曲技术', '作曲2023班', '南昌市西湖区某小区', '0791-12345678', '13803638000');
INSERT INTO `inform` VALUES ('2023100041', '鲁四三', '2004-04-05', '男', '计算机学院', '人工智能', '人工智能2023班', '北京市东城区某小区', '010-76543210', '13703737000');
INSERT INTO `inform` VALUES ('2023100042', '韦四四', '2003-02-16', '女', '电子信息学院', '微电子科学', '微电子2023班', '上海市长宁区某小区', '021-87654321', '13903839000');
INSERT INTO `inform` VALUES ('2023100043', '昌四五', '2001-11-22', '男', '机械工程学院', '车辆工程', '车辆工程2023班', '广州市白云区某小区', '020-12344321', '13703937000');
INSERT INTO `inform` VALUES ('2023100044', '马四六', '2003-06-18', '女', '经济管理学院', '经济学', '经济学2023班', '成都市青羊区某小区', '028-98765432', '13604036000');
INSERT INTO `inform` VALUES ('2023100045', '花四七', '2004-12-12', '男', '建筑学院', '城乡规划', '城乡规划2023班', '南京市玄武区某小区', '025-54321678', '13504135000');
INSERT INTO `inform` VALUES ('2023100046', '方四八', '2002-07-30', '女', '艺术学院', '服装与服饰设计', '服饰设计2023班', '杭州市上城区某小区', '0571-21345678', '13804238000');
INSERT INTO `inform` VALUES ('2023100047', '石四九', '2001-05-09', '男', '外国语学院', '德语', '德语2023班', '武汉市青山区某小区', '027-76543210', '13704337000');
INSERT INTO `inform` VALUES ('2023100048', '钟五十', '2003-03-03', '女', '法学院', '知识产权法', '知识产权法2023班', '重庆市南岸区某小区', '023-12341234', '13904439000');
INSERT INTO `inform` VALUES ('2023100049', '陈五一', '2002-10-20', '男', '经济管理学院', '金融学', '金融学2023班', '西安市灞桥区某小区', '029-87654321', '13704537000');
INSERT INTO `inform` VALUES ('2023100050', '褚五二', '2004-01-08', '女', '教育学院', '特殊教育', '特殊教育2023班', '长沙市岳麓区某小区', '0731-12345678', '13804638000');
INSERT INTO `inform` VALUES ('2023100080', '谭嗣同', '1949-10-01', '男', '艺术学院', '社会变革学', '社会变革学1949级', '南京市六合区某小区', '025-66666666', '15951620580');
INSERT INTO `inform` VALUES ('2023100081', '钱学森', '2005-05-04', '男', '机械工程学院', '兵器制造', '兵器制造2023班', '南京市六合区某小区', '025-75820566', '15951620336');

SET FOREIGN_KEY_CHECKS = 1;
